Repository: GianGythub/bme2Nvda
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: it

source: reports the current line under the application cursor
it: Legge la riga corrente

source: reads from the begining of the document up to the end of the text.
it: Legge il documento dall'inizio alla fine

source: reads from the cursor up to the end of the text.
it: Legge dalla posizione del cursore fino alla fine del documento

source: reads from the begining of the document up to the cursor.
it: Legge dall'inizio del documento fino alla posizione del cursore

source: report the current selected text
it: Legge il testo selezionato corrente

source: reports the element properties under the cursor if they exists
it: Legge le proprietà dell'elemento al cursore, se presenti

source: reports the element lyrics under the cursor if exists
it: Legge la lirica all'elemento del cursore, se presente

source: moved to position %d of %d
it: Spostato alla posizione %d di %d

source: hold down control key to order elements in the list
it: Tenere premuto il tasto ctrl per ordinare gli elementi in elenco

source: removed from list
it: Rimosso dall'elenco

source: Add-on to provide bme2 accessibility with NVDA In the main editor and special edit field, During cursor movementts and during editing, music elements are spoken correctly and presented on the Braille display. In addition,you can use these commands: Nvda+Alt+upArrow: reads from the begining of the text until the cursor position. Nvda+alt+downArrow: reads from the position of the cursor until the end of the text Nvda+o: reads the properties of the musical element if any. F12: reports lyrics of the element under the cursor, if present.
it: Addon per fornire accessibilità in Bme2 con Nvda Nell'editor principale e nelle caselle di testo speciali, negli spostamenti del cursore e durante l'immissione, gli elementi musicali vengono pronunciati correttamente e mostrati sul display Braille. In aggiunta, si possono usare i comandi seguenti: Nvda+Alt+freccia sù: legge dall'inizio del documento fino alla posizione del cursore Nvda+alt+freccia giù: legge dalla posizione del cursore fino alla fine del documento. Nvda+o: Legge le proprietà dell'elemento al cursore, se presenti. F12: legge la lirica dell'elemento al cursore, se presente.
